# Используем базовый образ Python
FROM python:3.10-slim

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем все файлы из текущей директории в рабочую директорию контейнера
COPY . .

# Устанавливаем зависимости
RUN pip install --no-cache-dir -r requirements.txt

# Определяем переменную окружения для токена бота (можешь передавать через переменную среды при запуске)
ENV BOT_TOKEN=7706591865:AAHbJxE74kRGhbhn4gl1UrD0PkAAqOsaISY

# Открываем порт, если нужно для взаимодействия через сеть (опционально, зависит от твоего приложения)
EXPOSE 8000

# Запускаем бота
CMD ["python", "bot_resizer.py"]
